<?php
/**
*  +----------------------------------------------------------------------------------------------+
*   | Explain:  文章模型类
*  +----------------------------------------------------------------------------------------------+
*   | Author: ONLY <491518132@qq.com>
*  +----------------------------------------------------------------------------------------------+
*   | Creater Time : 2014-1-17 	
*  +----------------------------------------------------------------------------------------------+
*   | Link :		http://www.phpyrb.com	     
*  +----------------------------------------------------------------------------------------------+
**/
	namespace Blog\Model;
	use Think\Model;
	class ArticleModel extends Model{
		protected $Article;
		function _initialize(){
			$this->Article = M('Article');
		}
		
		function artlist($_limit = '0,15'){
			$artlist = $this->Article->order('uptime DESC')->limit($_limit)->select();
			return $artlist;
		}
	}